Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: Accessing Accessibility Settings
ja: アクセシビリティ設定にアクセスする

source: Accessing Cases
ja: ケース節にアクセスする

source: Accessing Color Schemes
ja: カラースキームにアクセスする

source: Accessing Content
ja: 内容にアクセスする

source: Accessing Control Attributes
ja: コントロール属性にアクセスする

source: Accessing Core Data Stores
ja: Core Dateストアにアクセスする

source: Accessing Guide Values
ja: ガイド値にアクセスする

source: Accessing List Styles
ja: リストスタイルにアクセスする

source: Accessing Locale Information by Key
ja: ロケール情報にキーによってアクセスする

source: Accessing Paragraph Styles
ja: 段落スタイルにアクセスする

source: Accessing Size Classes
ja: サイズクラスにアクセスする

source: Accessing Standard Colors
ja: 標準カラーにアクセスする

source: Accessing Text Field Styles
ja: テキストフィールトスタイルにアクセスする

source: Accessing Values Using Dynamic Member Lookup
ja: 動的メンバールックアップを使って値にアクセスする

source: Accessing View Settings
ja: ビュー設定にアクセスする

source: Accessing Wheel Picker Styles
ja: ホイールピッカースタイルにアクセスする

source: Activates the view as the source of a drag and drop operation.
ja: ビューをドラッグアンドドロップ操作のソースとして活動させます。

source: Add Gesture Modifiers to a View
ja: ジェスチャ修飾子をビューに加える

source: Add a drag gesture to a Circle and change its color while the user performs the drag gesture:
ja: あるドラッグジェスチャをCircleに加えて、そしてそれの色をユーザがドラッグジェスチャを実行する間に変更します：

source: Add a long-press gesture to a Circle to animate its color from blue to red, and then change it to green when the gesture ends:
ja: ある長押しジェスチャをCircleに加えることでそれの色を青から赤にアニメーション化します、それからジェスチャが終わる時にそれを緑に変更します：

source: Add a long-press gesture to a Circle, and update the interface during the gesture by declaring a property as GestureState:
ja: 長押しジェスチャをCircleに加えて、そしてジェスチャの間にインターフェイスの更新を行ってください、あるプロパティをGestureStateとして宣言することによって:

source: Add a magnification gesture to a Circle that changes its size while the user performs the gesture:
ja: ある拡大ジェスチャをCircleに加えます、それはそれの大きさをユーザがそのジェスチャを実行する間に変更します：

source: Add a rotation gesture to a Rectangle and apply a rotation effect:
ja: 回転ジェスチャをRectangleに加えて、回転効果を適用します：

source: Add and configure an extension to show your app’s content on the iOS Home screen and macOS Notification Center.
ja: ある拡張を追加そして構成設定することで、あなたのアプリのもつ内容をiOSホーム画面およびmacOS通知センター上で示します。

source: Add menu commands to a scene by applying CommandMenu instances.
ja: メニューコマンドそれらを、CommandMenuインスタンスそれらを適用することによってシーンに加えてください。

source: Adding Animations to a View
ja: アニメーションをビューに加える

source: Adding Buttons to Containers
ja: ボタンをコンテナに加える

source: Adding Interactivity with Gestures
ja: 相互作用をジェスチャに加える

source: Adding Modifier Keys to a Gesture
ja: 修飾子キーをジェスチャに加える

source: Adding and Removing Child Nodes
ja: 子ノードの追加と除去

source: Adding and Removing Elements
ja: 要素の追加と削除

source: Additionally, the following values are supported for macOS platform development:
ja: 加えて、以下の値がmacOSプラットホーム開発用にサポートされます：

source: Adds a border to the view with the specified style and width.
ja: 境界線をビューにこの指定されたスタイルと幅で加えます。

source: Adds a child node after the last of the receiver’s existing children.
ja: ある子ノードを最後のレシーバのもつ既存の子の後に加えます。

source: Adds a child node at the end of the receiver’s current list of children.
ja: ある子ノードをレシーバのもつ子それらの現在のリストの終わりで加えます。

source: Adds a child node to the end of the list of existing children.
ja: ある子ノードを既存の子それらのリストの最後に加えます。

source: Adds a color multiplication effect to the view.
ja: ある色乗算効果をビューに加えます。

source: Adds a color multiplication effect to this view.
ja: 色乗算効果をこのビューに加えます。

source: Adds a condition for whether the view's view hierarchy is movable.
ja: ビューのもつビュー階層が移動可能であるかどうかに対するある条件を加えます。

source: Adds a condition for whether the view’s view hierarchy is deletable.
ja: ビューのもつビュー階層が削除可能であるかどうかに対するある条件を加えます。

source: Adds a condition for whether the view’s view hierarchy is movable.
ja: ビューのもつビュー階層が移動可能であるかどうかに対するある条件を加えます。

source: Adds a condition for whether users can interact with the view.
ja: ユーザがビューと相互作用できるかどうかに対するある条件を加えます。

source: Adds a context menu to the view.
ja: あるコンテキストメニューをビューに加えます。

source: Adds a cubic Bézier curve to the path, with the specified end point and control points.
ja: ある3次ベジェ曲線をこのパスに加えます、指定された終点と制御点で。

source: Adds a custom accessibility action to the view and all subviews.
ja: あつらえのアクセシビリティアクションをビューおよび全てのサブビューに加えます。

source: Adds a custom accessibility action to the view.
ja: あつらえのアクセシビリティアクションをビューに加えます。

source: Adds a grayscale effect to the view.
ja: グレイスケール効果をビューに加えます。

source: Adds a grayscale effect to this view.
ja: グレイスケール効果をこのビューに加えます。

source: Adds a label to the view that describes its contents.
ja: ビューにそれの内容を記述するラベルを加えます。

source: Adds a luminance to alpha effect to the view.
ja: 輝度をビューへのアルファ効果に加えます。

source: Adds a luminance to alpha effect to this view.
ja: ある輝度をこのビューへのアルファ効果に加えます。

source: Adds a modifier for this view that fires an action when a specific value changes.
ja: ある修飾子をこのビューに対して加えます、それはあるアクションをある特定の値が変化する時に開始します。

source: Adds a namespace node to the receiver.
ja: ある名前空間ノードをレシーバへと加えます。

source: Adds a quadratic Bézier curve to the path, with the specified end point and control point.
ja: 2次ヘジェ曲線をこのパスに加えます、指定された終点と制御点で。

source: Adds a rectangular subpath to the path.
ja: ある矩形のサブパスをこのパスに加えます。

source: Adds a rounded rectangle to the path.
ja: ある角丸矩形をこのパスに加えます。

source: Adds a sequence of connected straight-line segments to the path.
ja: 一連の接続された直線分をこのパスに加えます。

source: Adds a sequence of rectangular subpaths to the path.
ja: 一連の矩形のサブパスをこのパスに加えます。

source: Adds a shadow to the view.
ja: 影をビューに加えます。

source: Adds a shadow to this view.
ja: 影をこのビューに加えます。

source: Adds a textual description of the value that the view contains.
ja: ビューのテキスト記述を加えます、それはビューが含みます。

source: Adds an accessibility action to this view.
ja: アクセシビリティアクションをこのビューに加えます。

source: Adds an accessibility adjustable action to the view.
ja: アクセシビリティ調節可能アクションをこのビューに加えます。

source: Adds an accessibility scroll action to the view.
ja: アクセシビリティスクロールアクションをこのビューに加えます。

source: Adds an action to perform in response to a move command, like when the user presses an arrow key on a Mac keyboard, or taps the edge of the Siri Remote when controlling an Apple TV.
ja: ユーザが矢印キーをMacキーボード上で押す時のような、またはApple TVを制御している時にSir Remoteの縁をタップするような、移動コマンドに答えて実行するアクションを加えます。

source: Adds an action to perform in response to the given selector.
ja: 与えられたセレクタに答えて実行するアクションを加えます。

source: Adds an action to perform in response to the system’s Copy command.
ja: システムのもつ「コピー」コマンドに答えて実行するアクションを加えます。

source: Adds an action to perform in response to the system’s Cut command.
ja: システムのもつ「カット」コマンドに答えて実行するアクションを加えます。

source: Adds an action to perform in response to the system’s Delete command.
ja: システムのもつ「削除」コマンドに答えて実行するアクションを加えます。

source: Adds an action to perform in response to the system’s Paste command with items that you validate.
ja: システムのもつ「ペースト」コマンドに答えて、あなたが検証する項目とともに実行するアクションを加えます。

source: Adds an action to perform in response to the system’s Paste command.
ja: システムのもつ「ペースト」コマンドに答えて実行するアクションを加えます。

source: Adds an action to perform in response to the system’s Play/Pause command.
ja: システムのもつ「再生／一時停止」コマンドに答えて実行するアクションを加えます。

source: Adds an action to perform when the gesture ends.
ja: ジェスチャが終わる時に実行するアクションを加えます。

source: Adds an action to perform when the gesture’s value changes.
ja: ジェスチャのもつ値が変化する時に実行するアクションを加えます。

source: Adds an action to perform when the given value changes.
ja: 与えられた値が変化する時に実行するアクションを加えます。

source: Adds an action to perform when the specified preference key’s value changes.
ja: 指定されたプレファレンスキーのもつ値が変化する時に実行するアクションを加えます。

source: Adds an action to perform when the user moves the pointer over or away from the view’s frame.
ja: ユーザがポインタをビューのもつフレームに重ねるまたは遠ざける時に実行するアクションを加えます。

source: Adds an action to perform when the view appears.
ja: ビューが姿を現わす時に実行するアクションを加えます。

source: Adds an action to perform when the view disappears.
ja: ビューが姿を消す時に実行するアクションを加えます。

source: Adds an action to perform when this view appears.
ja: あるアクションを加えて、このビューが現れる時に実行します。

source: Adds an action to perform when this view detects data emitted by the given publisher.
ja: このビューがこの与えられたパブリッシャーによって発布されたデータを検出する時に実行するアクションを加えます。

source: Adds an action to perform when this view disappears.
ja: あるアクションを加えて、このビューが姿を消す時に実行します。

source: Adds an action to perform when this view recognizes a long press gesture.
ja: このビューが長押しジェスチャを認識する時に実行するアクションを加えます。

source: Adds an action to perform when this view recognizes a tap gesture.
ja: このビューがタップジェスチャを認識する時に実行するアクションを加えます。

source: Adds an arc of a circle to the path, specified with a radius and a difference in angle.
ja: ある円の円弧をこのパスに加えます、半径と角度での差分で指定して。

source: Adds an arc of a circle to the path, specified with a radius and angles.
ja: ある円の円弧をこのパスに加えます、半径と角度で指定して。

source: Adds an arc of a circle to the path, specified with a radius and two tangent lines.
ja: ある円の円弧をこのパスに加えます、半径と２つの正接線で指定して。

source: Adds an attribute node to the receiver.
ja: ある属性ノードをレシーバに加えます。

source: Adds an ellipse to the path.
ja: ある楕円をパスに加えます。

source: Adds bold styling to the font.
ja: ボールドスタイルをフォントに加えます。

source: Adds commands to the scene.
ja: コマンドをシーンに加えます。

source: Adds help text to a view using a localized string that you provide.
ja: ヘルプテキストをビューへと加えます、あなたが提供するローカライズされた文字列を使います。

source: Adds help text to a view using a string that you provide.
ja: ヘルプテキストをビューへと加えます、あなたが提供する文字列を使います。

source: Adds help text to a view using a text view that you provide.
ja: ヘルプテキストをビューへと加えます、あなたが提供するテキストビューを使います。

source: Adds information about how the view behaves.
ja: どのようにビューが振る舞うかについての情報を加えます。

source: Adds italics to the font.
ja: イタリック体をフォントに付け加えます。

source: Adds the given element to the option set if it is not already a member.
ja: 与えられた要素を、それがすでにメンバでないならばオプションセットに加えます。

source: Adds the given traits to the view.
ja: 与えられた特徴をビューに加えます。

source: Adds two values and stores the result in the left-hand-side variable.
ja: ２つの値を加算して、結果を左手側の変数に格納します。

source: Adjusting Text in a View
ja: テキストをビューに合わせる

source: Adjusting the Padding of a View
ja: ビューの詰めを調節する

source: Adjusts the color saturation of the view.
ja: ビューの色彩度を補正します。

source: Adjusts the color saturation of this view.
ja: このビューの色彩度を調整します。

source: Adjusts the font to enable all small capitals.
ja: フォントを調節してオールスモールキャピタルを可能にします。

source: Adjusts the font to enable lowercase small capitals.
ja: フォントを調節してローワケースにスモールキャピタルを可能にします。

source: Adjusts the font to enable uppercase small capitals.
ja: フォントを調節してアッパーケースにスモールキャピタルを可能にします。

source: Adjusts the font to use monospace digits.
ja: フォントを調節して等幅を使うようにします。

source: Adopt this protocol in one of your app's custom instances, and use its methods to create, update, and tear down your interface object.
ja: このプロトコルをあなたのアプリのもつあつらえのインスタンスの１つにおいて採用して、そしてそれのメソッドを使ってあなたのインターフェイスオブジェクトを作成、更新、そして解体してください。

source: Adopt this protocol in one of your app's custom instances, and use its methods to create, update, and tear down your view controller.
ja: このプロトコルをあなたのアプリのもつあつらえのインスタンスの１つにおいて採用して、そしてそれのメソッドを使ってあなたのビューコントローラを作成、更新、そして解体してください。

source: Adopt this protocol in one of your app's custom instances, and use its methods to create, update, and tear down your view.
ja: このプロトコルをあなたのアプリのもつあつらえのインスタンスの１つにおいて採用して、そしてそれのメソッドを使ってあなたのビューを作成、更新、そして解体してください。

source: Adopting View Color Schemes
ja: ビューのカラースキームを採用する

source: Affect the way the system draws a view, for example by scaling or masking a view, or by applying graphical effects.
ja: システムがビューを描画する方法に影響を与えます、例えばあるビューを拡大縮小またはマスクすることによって、またはグラフィカル効果を適用することによって。

source: Affine transforms present a mathematical approach to applying combinations of rotation, scaling, translation, and skew to shapes.
ja: アフィン変換は、回転、拡大縮小、変換、そして傾斜の組み合わせを形状に適用するための数学的取り組みを提示します。

source: After closing the subpath, the current point becomes undefined.
ja: サブパスを閉じた後、現在のポイントは未定義になります。

source: After the user finishes the long press and the drag state changes to dragging, a border appears around the shape to indicate that the user may begin moving the view.
ja: ユーザが長押しを終了するそしてドラッグ状態がdraggingに変化する後に、境界線が形状の周りに現れて、ユーザがビューの移動を始めるかもしれないことを指し示します。

source: After using firstIndex(of:) to find the position of a particular element in a collection, you can use it to access the element by subscripting.
ja: firstIndex(of:)を使って特定の要素の位置をあるコレクションの中で見つけた後、あなたは添え字によって要素にアクセスするためにそれを使うことができます。

source: After using lastIndex(of:) to find the position of the last instance of a particular element in a collection, you can use it to access the element by subscripting.
ja: lastIndex(of:)を使って特定の要素の位置をあるコレクションの中で見つけた後、あなたは添え字によって要素にアクセスするためにそれを使うことができます。

source: Aligning Views
ja: 値を調節する

source: All container views update and adjust the positions of their children in response to changes in content or interface dimensions.
ja: 全てのコンテナビューは、内容またはインターフェイス次元それらにおける変化に答えて、それらの子の位置を更新および調節します。

source: All possible modifier keys.
ja: 全ての可能な修飾子キー。

source: Allow optional values to initialize by default to nil.
ja: オプショナル値に初期状態でnilに初期化することを許可します。

source: Also, using any nonzero amount of tracking disables nonessential ligatures, whereas kerning attempts to maintain ligatures.
ja: また、なんらかの非ゼロ量のトラッキングを使うことは、非本質のリガチャを無効にします、だけれどもカーニングはリガチャを保守しようとします。

source: Alternatively, a predicate can be satisfied by a range of Equatable elements or a general condition.
ja: あるいは、述部は、Equatable要素のある範囲またはある一般的条件によって満たされることができます。

source: Alternatively, for simple drop cases that don’t require the full functionality of a drop delegate, you can modify a view to accept drops using the onDrop(of:isTargeted:perform:) or the onDrop(of:isTargeted:perform:) method.
ja: 代わりに、ドロップ委任先の完全な機能性を必要としない単純なドロップの場合に対して、あなたはonDrop(of:isTargeted:perform:)またはonDrop(of:isTargeted:perform:)メソッドを使ってドロップを受け入れるようにビューを修正できます。

source: Alternatively, you can define shapes in terms of absolute coordinates.
ja: あるいはまた、あなたは形状を絶対座標の観点から定義できます。

source: Although .express is not a member of options, .express subsumes the remaining .secondDay element of the option set.
ja: とは言え.expressはoptionsのメンバではありません、しかし.expressはこのオプションセットの残りの要素.secondDayを包含します。

source: Although a scanner object’s class is private, its interface is public, as declared by this abstract superclass, Scanner.
ja: スキャナーオブジェクトのもつクラスがプライベートであるにもかかわらず、それのインターフェイスはパブリックです、この抽象サブクラス、Scannerによって宣言されるように。

source: Always call this method from your WatchKit extension's main thread.
ja: 常にこのメソッドをあなたのWatchKit拡張のもつメインスレッドから呼び出してください。

source: Always specify at least one size characteristic when calling this method.
ja: このメソッドを呼び出している場合は、常に少なくとも１つのサイズ特徴を指定してください。

source: Always use the slice’s startIndex property instead of assuming that its indices start at a particular value.
ja: 常にスライスのstartIndexプロパティを使ってください、それのインデックスが特定の値で始まると決めてかかるのではなく。

source: Among the XML family of classes (excluding XMLParser) the XMLNode class is the base class.
ja: クラスのXMLファミリーの間で（XMLParserを除いて）XMLNodeクラスは基盤クラスです。

source: An NSViewController object that you can present from your interface.
ja: あるNSViewControllerオブジェクト、それはあなたがあなたのインターフェイスから提示できるものです。

source: An NSError object from which you can obtain information about a parsing error.
ja: あるNSErrorオブジェクト、それからあなたは構文解析エラーについての情報を入手できます。

source: An Process object can only be run once.
ja: Processオブジェクトは、一度だけ実行されることのみが可能です。

source: An AnyView allows changing the type of view used in a given view hierarchy.
ja: AnyViewは、与えられたビュー階層において使われるビューの型の変更を許可します。

source: An Image is a late-binding token; the system resolves its actual value only when it’s about to use the image in a given environment.
ja: Imageは遅延バインディングのトークンです；システムがそれの実際の値を解決するのは、それがイメージをある与えられた環境でまさに使おうとする時のみです。

source: An NSHostingController obect initialized with the specified SwiftUI view.
ja: あるNSHostingControllerオブジェクト、この指定されたSwiftUIビューで初期化されます。

source: An NSHostingView object initialized with the specified SwiftUI view.
ja: あるNSHostingViewオブジェクト、この指定されたSwiftUIビューで初期化されます。

source: An NSViewControllerRepresentableContext structure contains details about the current state of the system.
ja: NSViewControllerRepresentableContext構造体は、システムの現在の状態についての詳細を含みます。

source: An NSViewRepresentableContext structure contains details about the current state of the system.
ja: NSViewRepresentableContext構造体は、システムの現在の状態についての詳細を含みます。

source: An UIHostingController obect initialized with the specified SwiftUI view.
ja: あるUIHostingControllerオブジェクト、この指定されたSwiftUIビューで初期化されます。

source: An NSNumber object that contains a value corresponding to one of the NSKeyValueChange enums, indicating what sort of change has occurred.
ja: あるNSNumberオブジェクト、それはNSKeyValueChange列挙の１つに対応しているある値を含んでいて、発生した変更の種類は何かを指し示しています。

source: An XMLDocument object can have multiple child nodes but only one element, the root element.
ja: XMLDocumentオブジェクトは、複数の子ノードを持つことが出来ます、しかしただ１つの要素、ルート要素を除いては。

source: An XMLElement object may have child nodes, specifically comment nodes, processing-instruction nodes, text nodes, and other XMLElement nodes.
ja: XMLElementオブジェクトは、子ノードを持つかもしれません、具体的にはコメントノード、処理命令ノード、テキストノード、そして他のXMLElementノード。

source: An XMLParser notifies its delegate about the items (elements, attributes, CDATA blocks, comments, and so on) that it encounters as it processes an XML document.
ja: XMLParserは、それの委任先に、それがXML書類を処理するにつれてそれが出くわす項目（要素、属性、CDATAブロック、コメント、など）について通知します。

source: An XMLDocument object may also have document-global attributes, such as XML version, character encoding, referenced DTD, and MIME type.
ja: XMLDocumentオブジェクトはまた、文書にグローバルな属性、たとえばXMLバージョン、文字符号化、参照DTD、そしてMIMEタイプなどを持つかもしれません。

source: An Pipe object represents both ends of a pipe and enables communication through the pipe.
ja: Pipeオブジェクトは、パイプの両方の終端を表します、

source: An AppKit view controller that hosts a set of SwiftUI views.
ja: あるAppKitビューコントローラ、それは一揃いのSwiftUIビューをホストします。

source: An AppKit view that hosts a SwiftUI view hierarchy.
ja: あるAppKitビュー、それはSwiftUIビュー階層をホストします。

source: An XML document as internalized into a logical tree structure.
ja: 論理ツリー構造への内面化としてのXML文書。

source: An abstract class used to transform values from one representation to another.
ja: 一方の表現から他方へ値を変換するのに使われる抽象クラス。

source: An affordance for creating hierarchical view content.
ja: 階層ビュー内容を作成することに対するアフォーダンス。

source: An affordance for grouping view content.
ja: ビュー内容をまとめることに対するアフォーダンス。

source: An alert button that indicates cancellation.
ja: 取り消しを指し示すアラートボタン。

source: An alignment in both axes.
ja: 両方の軸におけるある整列。

source: An alignment position along the horizontal axis.
ja: 水平軸に沿った整列位置。

source: An alignment position for text along the horizontal axis.
ja: 水平軸に沿ったテキストの整列位置。

source: An anchor source rect defined as the entire bounding rect of the current view.
ja: 現在のビューの境界矩形全体として定義されるアンカーソース矩形。

source: An angular gradient is also known as a “conic” gradient.
ja: 角勾配はまた “円錐” 勾配として知られます。

source: An angular gradient.
ja: 角勾配（角度によるグラデーション）。

source: An animation sequence performed when the binding value changes.
ja: バインディング値が変化する時に実行されるアニメーション一連なり。

source: An array containing the transformed elements of this sequence.
ja: このシーケンスの変換済み要素を含んでいる配列。

source: An array of UTI types that the dynamic view supports.
ja: 動的ビューをサポートするUTI型それらからなるある配列。

source: An array of subsequences, split from this collection’s elements.
ja: このコレクションの要素を分割した、下位シーケンスいくらかからなる配列。

source: An array of subsequences, split from this sequence’s elements.
ja: このシーケンスの要素を分割した、下位シーケンスいくらかからなる配列。

source: An array of the elements that isIncluded allowed.
ja: isIncludedが許可する要素からなる配列。

source: An array of the non-nil results of calling transform with each element of the sequence.
ja: シーケンスの各要素でtransformを呼ぶことの非nilの結果の配列。

source: An array of this sequence’s elements in a shuffled order.
ja: シャッフルされた順番でのこのシーケンスのもつ要素からなる配列。

source: An array of tuples, each of which contains the following elements:
ja: いくつかのタプルからなるある配列、そのそれぞれが以下の要素を含みます：

source: An effect that changes the visual appearance of a view, largely without changing its ancestors or descendants.
ja: ある効果、それはビューの視覚的外観を変更します、大部分はそれのアンカーまたは子孫それらを変更することなしに。

source: An effect that changes the visual appearance of a view, largely without changing its ancestors or descendents.
ja: ある効果、それはビューの視覚的外観を変更します、大部分はそれのアンカーまたは子孫それらを変更することなしに。

source: An efficient set of Edges.
ja: ある効率的な一揃いのEdge。

source: An element of a path.
ja: あるパスのある要素。

source: An element to search for in the collection.
ja: このコレクションにおいて捜される要素。

source: An ellipse aligned inside the frame of the view containing it.
ja: ある楕円、それを含んでいるビューの枠内に整列されます。

source: An empty type for animatable data.
ja: アニメーション可能データに対するある空の型。

source: An enumeration to indicate one edge of a rectangle.
ja: ある矩形の１つの縁を指し示すある列挙。

source: An environment object invalidates the current view whenever the observable object changes.
ja: 環境オブジェクトは、監視可能なオブジェクトが変化する時はいつでも、現在のビューを無効にします。

source: An environment-dependent color.
ja: 環境依存色。

source: An environment-dependent font.
ja: ある環境依存のフォント。

source: An event driven parser of XML documents (including DTD declarations).
ja: XML文書（DTD宣言を含む）のイベント駆動パーサ。

source: An example of a single view written as a child view is { Text("Hello") }.
ja: 子ビューとして書かれた単一のビューの例は、{ Text("Hello") }です。

source: An identifier for a transform that converts characters to Unicode names.
ja: 文字をユニコード名へ転換するある変換に対する識別子。

source: An identifier that uniquely identifies the horizontal alignment.
ja: ある識別子、それは水平整列を特有に識別します。

source: An identifier that uniquely identifies the vertical alignment.
ja: ある識別し、それは特有に垂直整列を識別します。

source: An immutable path representing the elements in the path.
ja: パスの中の要素それらを表している不変パス。

source: An immutable representation of a compiled regular expression that you apply to Unicode strings.
ja: 可変でない表現のコンパイル済み正規表現で、それをあなたはユニコード文字列に適用します。

source: An immutable value.
ja: 不変の値。

source: An index offset by distance from the index i, unless that index would be beyond limit in the direction of movement.
ja: distanceだけインデックスiから埋め合わされるあるインデックス、そのインデックスがその動く方向においてlimitを越えない限り。

source: An index offset by distance from the index i.
ja: distanceだけインデックスiから補われるインデックス。

source: An initial state value.
ja: 初期状態値。

source: An initial value for the gesture state property.
ja: ジェスチャ状態プロパティに対する初期値。

source: An initial value of the state.
ja: 状態の初期値。

source: An initial value.
ja: 初期値。

source: An initial wrappedValue for a state.
ja: ある状態に対する初期wrappedValue。

source: An initialized NSHostingView object or nil if the object couldn't be created.
ja: 初期化されたNSHostingViewオブジェクトまたはオブジェクトが作成されることができなかったならばnil。

source: An input gesture that matches a sequence of events and returns a stream of values.
ja: ある入力ジェスチャ、それは一連のイベントに合致するものです、そして値いくつかからなるあるストリームを返します。

source: An instance of a Transaction.
ja: Transactionのインスタンス。

source: An instance of a transaction, set as the thread’s current transaction.
ja: あるトランザクションのインスタンス、スレッドのもつ現在のトランザクションとして設定されます。

source: An instance of the XMLDTD class is held as a property of an XMLDocument instance, accessed through the XMLDocument method dtd (and set via setDTD:).
ja: XMLDTDクラスのインスタンスは、XMLDocumentインスタンスのプロパティとして保持されます、XMLDocumentのメソッドdtdを通してアクセスされます（そしてsetDTD:経由で設定されます）。

source: An instance that matches a sequence of events to a gesture, and returns a stream of values for each of its states.
ja: あるインスタンス、それは一連のイベントをあるジェスチャと組み合わせます、そしてそれの状態それぞれに対する値からなるあるストリームを返します。

source: An instance you use to communicate your AppKit view's behavior and state out to SwiftUI objects.
ja: あなたのAppKitビューのもつ挙動と状態をSwiftUIオブジェクトに広めるよう伝達するためにあなたが使うインスタンス。

source: An interface for a stored variable that updates an external property of a view.
ja: あるビューの外部プロパティを更新しているある格納変数に対するインターフェイス。

source: An interface that you implement to interact with a drop operation in a view modified to accept drops.
ja: あるインターフェイス、それはドロップを受け入れるよう修正されるビューにおいてドロップ操作と相互作用するためにあなたが実装するものです。

source: An object representing a subprocess of the current process.
ja: 現在の下位プロセスを表しているオブジェクト。

source: An object wrapper for primitive scalar numeric values.
ja: 原始的なスカラー数値に対するオブジェクトラッパー。

source: An object you use to communicate your AppKit view controller's behavior and state out to SwiftUI objects.
ja: あなたのAppKitビューコントローラのもつ挙動と状態をSwiftUIオブジェクトに広めるよう伝達するためにあなたが使うオブジェクト。
